app/controllers/api/collections_controller.rb

  def index
    render json: current_user.collections.all
---
SELECT `collections`.* FROM `collections` INNER JOIN `memberships` ON `collections`.`id` = `memberships`.`collection_id` WHERE `memberships`.`user_id` = 7 ORDER BY collections.name ASC