app/controllers/api/sessions_controller.rb

  def destroy
    user = User.find_by_authentication_token params[:auth_token]
---
SELECT `users`.* FROM `users` WHERE `users`.`authentication_token` = 'krjT1idznTx17FHppqCW' LIMIT 1