app/controllers/api/v1/sites_controller.rb

    def index
      search = new_search

      search.my_site_search current_user.id unless current_user.can_view_other? params[:collection_id]
      search.offset params[:offset]
      search.limit params[:limit]

      sites_size = search.results.total

      render :json =>{:sites => search.ui_results.map { |x| x['_source'] }, :total => sites_size}
---
SELECT `sites`.* FROM `sites` WHERE `sites`.`collection_id` = 54 ORDER BY sites.created_at DESC
SELECT COUNT(*) FROM `sites` WHERE `sites`.`collection_id` = 54

    def update
      site.attributes = sanitized_site_params(false).merge(user: current_user)

      if site.valid?
        site.save!
---
UPDATE `sites` SET `lat` = 11.553989600000003, `lng` = 104.93803783442377, `updated_at` = '2015-07-31 04:24:29', `properties` = '---\n\'267\': -5\n\'268\': -8\n\'269\': \'-13\'\n\'276\': Others\n\'277\': false\n\'278\': \'no\'\n' WHERE `sites`.`id` = 185
UPDATE `users` SET `last_sign_in_at` = '2015-07-31 04:24:28', `current_sign_in_at` = '2015-07-31 04:24:29', `sign_in_count` = 1802, `updated_at` = '2015-07-31 04:24:29' WHERE `users`.`id` = 7

    def create
      site = build_site
      create_state = site.id ? false : true #to create or update
      site.user_id = current_user.id
      if site.save
---
INSERT INTO `sites` (`collection_id`, `created_at`, `device_id`, `external_id`, `hierarchy`, `id_with_prefix`, `lat`, `lng`, `location_mode`, `name`, `parent_id`, `properties`, `updated_at`, `uuid`) VALUES (42, '2015-07-31 03:33:21', NULL, NULL, NULL, 'CG3', 11.554010400000001, 104.9337972, 'automatic', 'test', NULL, '---\n\'267\': 12\n\'268\': 12\n\'269\': \'24\'\n\'276\': Others\n\'277\': false\n\'278\': \'no\'\n', '2015-07-31 03:33:21', '2db93364-7f9b-4554-8afc-36427b97f02f')
UPDATE `users` SET `last_sign_in_at` = '2015-07-31 03:33:06', `current_sign_in_at` = '2015-07-31 03:33:21', `sign_in_count` = 1743, `updated_at` = '2015-07-31 03:33:21' WHERE `users`.`id` = 7