app/controllers/collections_controller.rb

INSERT INTO `collections` (`created_at`, `description`, `icon`, `lat`, `lng`, `max_lat`, `max_lng`, `min_lat`, `min_lng`, `name`, `public`, `quota`, `updated_at`) VALUES ('2015-08-03 04:22:09', '', 'hiking', NULL, NULL, NULL, NULL, NULL, NULL, 'Calculation A', 0, 0, '2015-08-03 04:22:09')
UPDATE `users` SET `collection_count` = 30, `updated_at` = '2015-08-03 04:22:09' WHERE `users`.`id` = 7
---
  def create
    p collection
    if current_user.create_collection collection
      current_user.collection_count += 1
      current_user.update_successful_outcome_status