app/controllers/layers_controller.rb

  def index
    respond_to do |format|
      format.html do
        show_collection_breadcrumb
        add_breadcrumb I18n.t('views.collections.index.properties'), collection_path(collection)
        add_breadcrumb I18n.t('views.collections.tab.layers'), collection_layers_path(collection)
      end
      if current_user_snapshot.at_present?
        json = layers.includes(:fields).all.as_json(:include => {:fields => {except: [:updated_at, :created_at]}}).each { |layer|
          layer["fields"].each { |field|
            field['threshold_ids'] = get_associated_field_threshold_ids(field)
            field['query_ids'] = get_associated_field_query_ids(field)
            field['report_query_ids'] = get_associated_field_report_query_ids(field)
          }
          layer['threshold_ids'] = Layer.find(layer['id']).get_associated_threshold_ids
---
SELECT `fields`.* FROM `fields` WHERE `fields`.`layer_id` IN (82) ORDER BY ord
SELECT `layers`.* FROM `layers` WHERE `layers`.`id` = 82 LIMIT 1

  def create
    layer = layers.new layer_params
    layer.collection_id = params[:collection_id]
    layer.user = current_user
    layer.save!
    current_user.layer_count += 1
    current_user.update_successful_outcome_status
---
INSERT INTO `layers` (`collection_id`, `created_at`, `name`, `ord`, `public`, `updated_at`) VALUES (56, '2015-08-03 04:22:42', 'General', 1, NULL, '2015-08-03 04:22:42')
UPDATE `users` SET `layer_count` = 39, `updated_at` = '2015-08-03 04:22:43' WHERE `users`.`id` = 7

  def update
    # FIX: For some reason using the exposed layer here results in duplicated fields being created
    layer = collection.layers.find params[:id]
    fix_layer_fields_for_update
    layer.user = current_user
    layer.update_attributes! params[:layer]
---
SELECT `layers`.* FROM `layers` WHERE `layers`.`collection_id` = 56 AND `layers`.`id` = 86 ORDER BY ord LIMIT 1
UPDATE `layers` SET `public` = 0, `updated_at` = '2015-08-03 04:53:15' WHERE `layers`.`id` = 86