app/controllers/queries_controller.rb

INSERT INTO `queries` (`collection_id`, `conditions`, `created_at`, `formula`, `isAllCondition`, `isAllSite`, `name`, `updated_at`) VALUES (52, '---\n- !ruby/hash:ActiveSupport::HashWithIndifferentAccess\n id: \'1\'\n field_id: \'299\'\n operator: empty\n field_value: \'null\'\n', '2015-07-14 09:23:32', '1', NULL, NULL, 'has no value', '2015-07-14 09:23:32')
---
	def create
    query = queries.new params[:query]
    query.save

SELECT `queries`.* FROM `queries` WHERE `queries`.`collection_id` = 52 AND `queries`.`id` = 45 LIMIT 1
UPDATE `queries` SET `updated_at` = '2015-07-14 09:28:19', `conditions` = '---\n- !ruby/hash:ActiveSupport::HashWithIndifferentAccess\n id: \'1\'\n field_id: \'299\'\n operator: empty\n field_value: \'null\'\n' WHERE `queries`.`id` = 45
---
  def update
    query = collection.queries.find params[:id]
    query.update_attributes! params[:query]