app/controllers/sessions_controller.rb

INSERT INTO `login_failed_trackers` (`created_at`, `ip_address`, `login_at`, `updated_at`) VALUES ('2015-07-27 08:24:36', '192.168.1.147', '2015-07-27 08:24:36', '2015-07-27 08:24:36')
---
  def new
    ip = meet_alert_ip
    if ip.size > Settings.number_of_attempt_failed
      @captcha = true
    else
      @captcha = false
    end
    # Check if user is login failed so it redirect from create action
    if params["user"]
      LoginFailedTracker.create!(:ip_address => request.remote_ip, :login_at => DateTime.now())

DELETE FROM `login_failed_trackers` WHERE `login_failed_trackers`.`id` = 1
SELECT `login_failed_trackers`.* FROM `login_failed_trackers` WHERE `login_failed_trackers`.`ip_address` = '127.0.0.1'
---
  def create
    unless current_user.nil?
      LoginFailedTracker.where("ip_address = ?",request.remote_ip).destroy_all