app/controllers/sites_controller.rb

  def create
    site_params = JSON.parse params[:site]
    ui_attributes = prepare_from_ui(site_params)
    site = collection.sites.new(ui_attributes.merge(user: current_user))
    if site.valid?
      site.save!
      current_user.site_count += 1
      current_user.update_successful_outcome_status
---
INSERT INTO `sites` (`collection_id`, `created_at`, `device_id`, `end_entry_date`, `external_id`, `hierarchy`, `id_with_prefix`, `lat`, `lng`, `location_mode`, `name`, `parent_id`, `properties`, `start_entry_date`, `updated_at`, `uuid`) VALUES (56, '2015-08-03 04:59:37', NULL, '2015-08-03 04:59:37', NULL, NULL, 'CS1', 14.121806, 59.29500400000006, 'automatic', 'Go1', NULL, '---\n\'324\': 12\n\'325\': 24\n\'326\': text\n', '2015-08-03 04:59:27', '2015-08-03 04:59:37', 'c6f0351e-8d7c-47fe-a6c8-78db85e74371')
UPDATE `users` SET `site_count` = 125, `updated_at` = '2015-08-03 04:59:38' WHERE `users`.`id` = 7

  def update
    site_params = JSON.parse params[:site]
    site.user = current_user
    site.properties_will_change!
    site.attributes = prepare_from_ui(site_params)
    if site.valid?
      site.save!
---
UPDATE `sites` SET `updated_at` = '2015-07-31 04:26:52', `properties` = '---\n\'267\': 3\n\'268\': 3\n\'269\': \'6\'\n\'276\': Others\n\'277\': false\n\'278\': \'no\'\n' WHERE `sites`.`id` = 186

  def update_property
    field = site.collection.fields.where_es_code_is params[:es_code]
    if not site.collection.site_ids_permission(current_user).include? site.id
      return head :forbidden unless current_user.can_write_field? field, site.collection, params[:es_code]
    end

    site.user = current_user
    site.properties_will_change!

    site.properties[params[:es_code]] = field.decode_from_ui(params[:value])
    if site.valid?
      site.save!
---
SELECT `collections`.* FROM `collections` WHERE `collections`.`id` = 42 LIMIT 1
SELECT `fields`.* FROM `fields` WHERE `fields`.`collection_id` = 42 AND `fields`.`id` = 269 ORDER BY ord LIMIT 1
SELECT id, uuid FROM `sites` WHERE (id = 184) LIMIT 1
UPDATE `sites` SET `properties` = '---\n\'267\': 12\n\'268\': 12\n\'276\': Others\n\'278\': \'no\'\n', `updated_at` = '2015-07-31 04:08:33' WHERE `sites`.`id` = 184

  def visible_layers_for
    layers = []
    if site.collection.site_ids_permission(current_user).include? site.id
      target_fields = fields.includes(:layer).all
---
SELECT `collections`.* FROM `collections` WHERE `collections`.`id` = 56 LIMIT 1
SELECT `layers`.* FROM `layers` WHERE `layers`.`id` IN (86)